Repository: karmihkr/Sayohat
Catalog: frontend/lib/l10n/app_*.arb
Languages: ru

# auth_type
source: Log in & Sign up
ru: Вход и регистрация

source: Enter your phone number
ru: Введите номер телефона

source: Phone number
ru: Номер телефона

source: Proceed
ru: Продолжить

source: Is your phone number correct?
ru: Номер телефона верен?

source: No, go back
ru: Нет, вернуться

source: Yes, go next!
ru: Да, дальше

# error_api_unreachable
source: API unreachable, please contact support
ru: Сервис недоступен. Свяжитесь с поддержкой

source: Fill in Telegram
ru: Введите Telegram-код

source: Verification code
ru: Код

# hint_code
source: Code
ru: Код

# button_confirm
source: Confirm
ru: Подтвердить

# error_enter_code
source: Enter the code
ru: Введите код

# error_incorrect_or_expired
source: Incorrect or expired code
ru: Неверный или истёкший код

# enter_name_surname
source: Enter your name and surname
ru: Введите имя и фамилию

# hint_name
source: Name
ru: Имя

# hint_surname
source: Surname
ru: Фамилия

# error_enter_name_surname
source: Enter your name and surname
ru: Введите имя и фамилию

# button_go_next
source: Go next!
ru: Далее

# hint_date_of_birth
source: Date of birth
ru: Дата рождения

# button_finish
source: Finish
ru: Готово

# error_add_date_of_birth
source: Add the date of your birth
ru: Укажите дату рождения

# error_valid_date_of_birth
source: Add the valid date of birth
ru: Введите корректную дату

source: General
ru: Общее

source: Ride details
ru: Детали поездки

source: Car information
ru: Информация об авто

# hint_from
source: From
ru: Откуда

# hint_to
source: To
ru: Куда

# hint_number_of_passengers
source: Number of passengers
ru: Кол-во мест

# button_find_ride
source: Find a ride!
ru: Найти поездку

# please_enter_field
source: Please enter {fieldName}
ru: Пожалуйста, введите {fieldName}

source: Please enter date
ru: Укажите дату

source: Use dd/mm/yyyy format
ru: Используйте дд/мм/гггг

source: Invalid date
ru: Неправильная дата

source: Date cannot be in the past
ru: Дата не может быть в прошлом

source: Please enter number of passengers
ru: Укажите кол-во мест

source: Please enter a valid number
ru: Введите корректное число

source: Number should be positive
ru: Значение должно быть больше нуля

# no_rides_found
source: Sorry, we did not find rides by your preferences, try another city or date
ru: По вашим параметрам ничего не найдено

# available_seats
source: Available seats: {seats}
ru: Свободных мест: {seats}

# cost_r
source: Cost: {cost} r.
ru: Стоимость: {cost} р.

# to_address_label
source: To: {address}
ru: Куда: {address}

# from_address_label
source: From: {address}
ru: Откуда: {address}

# years_old
source: {age} years old
ru: {age} лет

# ride_details_title
source: Ride Details
ru: Детали поездки

# driver_label
source: Driver: {fullName}
ru: Водитель: {fullName}

# age_label
source: Age: {age} years
ru: Возраст: {age} лет

# trip_details_heading
source: Trip Details
ru: Детали поездки

# date_label
source: Date: {date}
ru: Дата: {date}

# time_label
source: Time: {time}
ru: Время: {time}

# car_details_heading
source: Car Details
ru: Детали авто

# model_label
source: Model: {carModel}
ru: Модель: {carModel}

# color_label
source: Color: {carColor}
ru: Цвет: {carColor}

# car_plate_label
source: Car plate: {carPlate}
ru: Номер: {carPlate}

# description_heading
source: Description
ru: Описание

source: Book this ride
ru: Забронировать поездку

# empty_your_rides
source: There you will see list of your rides after adding
ru: Список появится после добавления поездок

source: Edit this ride
ru: Редактировать поездку

# error_data_unresolved
source: Data could not be resolved
ru: Не удалось загрузить данные

# label_phone
source: Phone:
ru: Телефон:

# label_date_of_birth
source: Date of birth:
ru: Дата рождения:

# rides_done
source: {count} rides were done
ru: Выполнено поездок: {count}

# button_edit_profile
source: Edit profile
ru: Редактировать профиль

source: Edit your profile
ru: Редактировать профиль

# label_your_name
source: Your name: {name}
ru: Ваше имя: {name}

# label_your_surname
source: Your surname: {surname}
ru: Ваша фамилия: {surname}

# label_your_phone_number
source: Your phone number: {phone}
ru: Ваш телефон: {phone}

# label_your_date_of_birth
source: Your date of birth: {birth}
ru: Ваша дата рождения: {birth}

# hint_new_name
source: New name
ru: Новое имя

# hint_new_surname
source: New surname
ru: Новая фамилия

# hint_new_phone_number
source: New phone number
ru: Новый телефон

# hint_new_date_of_birth
source: New date of birth
ru: Новая дата рождения

# button_confirm_changes
source: Confirm Changes
ru: Сохранить

# snackbar_info_updated
source: Info updated successfully
ru: Данные успешно обновлены

# snackbar_something_went_wrong
source: Something went wrong
ru: Что-то пошло не так

# tab_search
source: Search
ru: Поиск

# tab_add
source: Add
ru: Добавить

# tab_your_rides
source: Your rides
ru: Мои поездки

# tab_profile
source: Profile
ru: Профиль

source: Registration
ru: Регистрация

# hint_start_enter_address
source: Start enter the address
ru: Начните ввод адреса

# hint_date_ddmmyyyy
source: Date dd/mm/yyyy
ru: дд/мм/гггг

# hint_time_hhmm
source: Time hh:mm
ru: чч:мм

# hint_price
source: Price
ru: Цена

# hint_contact_info_rules
source: Contact info, rules etc.
ru: Контактная информация, правила и т.д.

# hint_car_model
source: Car Model
ru: Модель авто

# hint_car_color
source: Car color
ru: Цвет авто

# hint_car_plate
source: Car plate
ru: Номер авто

# button_back
source: Back
ru: Назад

# button_next
source: Next
ru: Далее

# button_complete
source: Complete
ru: Завершить

# error_enter_time
source: Enter time
ru: Укажите время

# error_invalid_time
source: Invalid time
ru: Неверное время

# error_enter_date
source: Please enter date
ru: Укажите дату

# error_format_date
source: Use dd/mm/yyyy format
ru: Используйте дд/мм/гггг

# error_invalid_date
source: Invalid date
ru: Неправильная дата

# error_date_past
source: Date cannot be in the past
ru: Дата не может быть в прошлом

# error_enter_passengers
source: Please enter number of passengers
ru: Укажите количество мест

# error_valid_number
source: Please enter a valid number
ru: Введите корректное число

# error_positive_number
source: Number should be positive
ru: Число должно быть положительным

# error_enter_address_short
source: Enter address
ru: Введите адрес

# error_enter_price
source: Enter price
ru: Укажите стоимость

# error_enter_description
source: Enter description
ru: Введите описание

# error_enter_car_model
source: Enter car model
ru: Укажите модель авто

# error_enter_car_color
source: Enter car color
ru: Укажите цвет авто

# error_enter_car_plate
source: Enter car plate
ru: Укажите номер авто

# success_ride_added
source: Ride was added successfully!
ru: Поездка успешно добавлена!

# hint_departure_address
source: Departure address
ru: Адрес отправления

# hint_destination_address
source: Destination address
ru: Адрес назначения

source: Please enter from
ru: Укажите пункт отправления

source: Please enter to
ru: Укажите пункт назначения

source: Number should be possitive
ru: Число должно быть положительным

# error_enter_address
source: Please, enter the address
ru: Введите адрес

# error_search_ride
source: Error while searching ride
ru: Ошибка при загрузке списка поездок
